-- Вставка данных в таблицу сотрудники
INSERT INTO employees (last_name, first_name, patronymic, position, rank, hire_date, status, shift_type)
VALUES 
('Горохов', 'Иван', 'Сергеевич', 'Мастер участка', '6 разряд', '2023-01-15', 'active', 'morning'),
('Красильников', 'Петр', 'Александрович', 'Начальник цеха', '6 разряд', '2022-03-10', 'active', 'morning'),
('Сидоров', 'Дмитрий', 'Борисович', 'Наладчик', '4 разряд', '2021-07-20', 'active', 'morning'),
('Соколов', 'Денис', 'Петрович', 'Термист', '5 разряд', '2020-04-20', 'active', 'evening'),
('Волков', 'Владимир', 'Денисович', 'Оператор печей', '6 разряд', '2019-07-08', 'active', 'night'),
('Васильев', 'Алексей', 'Валерьевич', 'Наладчик', '4 разряд', '2023-03-01', 'active', 'morning'),
('Иванов', 'Андрей', 'Владимирович', 'Термист', '5 разряд', '2018-10-29', 'active', 'evening'),
('Зайцев', 'Игорь', 'Алексеевич', 'Оператор печей', '6 разряд', '2021-09-06', 'active', 'night'),
('Сидоров', 'Захар', 'Васильевич', 'Наладчик', '6 разряд', '2017-01-22', 'active', 'morning'),
('Попов', 'Юрий', 'Викторович', 'Термист', '4 разряд', '2020-09-29', 'active', 'evening'),
('Лебедев', 'Федор', 'Олегович', 'Оператор печей', '5 разряд', '2021-03-16', 'active', 'night'),
('Семенов', 'Вадим', 'Андреевич', 'Наладчик', '6 разряд', '2021-06-27', 'active', 'morning'),
('Козлов', 'Валерий', 'Валерьевич', 'Мастер участка', '5 разряд', '2019-01-21', 'active', 'evening'),
('Новиков', 'Кирилл', 'Иванович', 'Термист', '6 разряд', '2022-07-15', 'active', 'night'),
('Виноградов', 'Геннадий', 'Викторович', 'Оператор печей', '4 разряд', '2021-08-26', 'active', 'morning'),
('Морозов', 'Игорь', 'Николаевич', 'Наладчик', '4 разряд', '2023-08-19', 'active', 'evening'),
('Богданов', 'Константин', 'Олегович', 'Термист', '6 разряд', '2018-04-16', 'active', 'night'),
('Соловьев', 'Леонид', 'Павлович', 'Оператор печей', '5 разряд', '2020-08-27', 'active', 'morning'),
('Воробьев', 'Александр', 'Алексеевич', 'Наладчик', '6 разряд', '2023-02-11', 'active', 'evening'),
('Орехов', 'Артем', 'Викторович', 'Термист', '6 разряд', '2019-07-29', 'active', 'night'),
('Жуков', 'Виталий', 'Вадимович', 'Оператор печей', '5 разряд', '2023-06-14', 'active', 'morning'),
('Прохоров', 'Алексей', 'Дмитриевич', 'Наладчик', '4 разряд', '2025-03-17', 'active', 'evening'),
('Цветков', 'Александр', 'Александрович', 'Термист', '6 разряд', '2025-07-28', 'active', 'night'),
('Медведев', 'Федор', 'Павлович', 'Мастер участка', '5 разряд', '2026-05-27', 'active', 'night' ),
('Калинин', 'Максим', 'Борисович', 'Оператор печей', '4 разряд', '2025-03-17', 'active', 'evening'),
('Одинцов', 'Василий', 'Альбертович', 'Наладчик', '5 разряд', '2024-08-20', 'active', 'night'),
('Тарасов', 'Георгий', 'Владимирович', 'Термист', '5 разряд', '2022-05-15', 'active', 'morning'),
('Фролов', 'Евгений', 'Вадимович', 'Оператор печей', '4 разряд', '2023-03-25', 'active', 'evening'),
('Мухин', 'Филипп', 'Михайлович', 'Наладчик', '6 разряд', '2024-11-07', 'active', 'night');

INSERT INTO employees (last_name, first_name, patronymic, position, rank, hire_date, status, shift_type)
VALUES 
('Устинов', 'Петр', 'Алексеевич', 'Термист', '5 разряд', '2022-05-15', 'active', 'morning'),
('Щуков', 'Макар', 'Олегович', 'Оператор печей', '4 разряд', '2023-03-25', 'active', 'evening'),
('Быков', 'Артур', 'Михайлович', 'Наладчик', '6 разряд', '2024-11-07', 'active', 'night'),
('Афанасьев', 'Иван', 'Вадимович', 'Термист', '5 разряд', '2022-05-15', 'active', 'morning');

INSERT INTO employees (last_name, first_name, patronymic, position, rank, hire_date, status, shift_type)
VALUES 
('Котов', 'Валерий', 'Павлович', 'Оператор печей', '5 разряд', '2022-05-15', 'active', 'evening');

-- Вставка данных в таблицу график работы

INSERT INTO work_schedules (employee_id, start_time, end_time, work_days)
VALUES 
(1, '08:00:00', '16:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(2, '08:00:00', '16:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(3, '08:00:00', '16:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(4, '16:00:00', '00:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(5, '00:00:00', '08:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(6, '08:00:00', '16:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(7, '16:00:00', '00:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(8, '00:00:00', '08:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(9, '08:00:00', '16:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(10, '16:00:00', '00:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(11, '00:00:00', '08:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(12, '08:00:00', '16:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(13, '16:00:00', '00:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(14, '00:00:00', '08:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(15, '08:00:00', '16:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(16, '16:00:00', '00:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(17, '00:00:00', '08:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(18, '08:00:00', '16:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(19, '16:00:00', '00:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(20, '00:00:00', '08:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(21, '08:00:00', '16:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(22, '16:00:00', '00:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(23, '00:00:00', '08:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(24, '00:00:00', '08:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(25, '16:00:00', '00:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(26, '08:00:00', '16:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(27, '08:00:00', '16:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(28, '16:00:00', '00:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(29, '00:00:00', '08:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(30, '08:00:00', '16:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(31, '16:00:00', '00:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(32, '00:00:00', '08:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(33, '08:00:00', '16:00:00', 'Mon,Tue,Wed,Thu,Fri'),
(34, '16:00:00', '00:00:00', 'Mon,Tue,Wed,Thu,Fri');

-- Вставка данных в таблицу Записи посещаемости


INSERT INTO attendance_records (employee_id, date, clock_in, clock_out, late_minutes, early_leave_minutes, notes)
VALUES 
(1, '2025-10-01', '08:03:00', '16:00:00', 3, 0, 'Опоздание на 3 минут'),
(1, '2025-10-02', '08:00:00', '16:00:00', 0, 0, 'Норма'),
(2, '2025-10-01', '08:02:00', '15:58:00', 2, 2, 'Опоздание и ранний уход'),
(2, '2025-10-02', '08:00:00', '16:00:00', 0, 0, 'Норма'),
(3, '2025-10-01', '08:05:00', '16:00:00', 5, 0, 'Опоздание на 5 минут'),
(3, '2025-10-02', '08:00:00', '16:00:00', 0, 0, 'Норма'),
(4, '2025-10-01', '16:00:00', '23:58:00', 0, 2, 'Ранний уход на 2 минуты'),
(4, '2025-10-02', '16:00:00', '00:00:00', 0, 0, 'Норма'),
(5, '2025-10-01', '00:00:00', '08:00:00', 0, 0, 'Норма'),
(5, '2025-10-02', '00:10:00', '08:00:00', 10, 0, 'Опоздание на 10 минут'),
(6, '2025-10-01', '08:00:00', '16:00:00', 0, 0, 'Норма'),
(6, '2025-10-02', '08:00:00', '16:00:00', 0, 0, 'Норма'),
(7, '2025-10-01', '16:00:00', '00:00:00', 0, 0, 'Норма'),
(7, '2025-10-02', '16:00:00', '23:50:00', 0, 10, 'Ранний уход на 10 минут'),
(8, '2025-10-01', '00:02:00', '07:56:00', 2, 4, 'Опоздание и ранний уход'),
(8, '2025-10-02', '00:00:00', '08:00:00', 0, 0, 'Норма'),
(9, '2025-10-01', '08:00:00', '16:00:00', 0, 0, 'Норма'),
(9, '2025-10-02', '08:30:00', '16:00:00', 30, 0, 'Опоздание на 30 минут'),
(10, '2025-10-01', '16:04:00', '23:53:00', 4, 7, 'Опоздание и ранний уход'),
(10, '2025-10-02', '16:00:00', '00:00:00', 0, 0, 'Норма'),
(11, '2025-10-01', '00:00:00', '08:00:00', 0, 0, 'Норма'),
(11, '2025-10-02', '00:00:00', '08:00:00', 0, 0, 'Норма'),
(12, '2025-10-01', '08:00:00', '16:00:00', 0, 0, 'Норма'),
(12, '2025-10-02', '08:00:00', '16:00:00', 0, 0, 'Норма'),
(13, '2025-10-01', '16:10:00', '00:00:00', 10, 0, 'Опоздание на 10 минут'),
(13, '2025-10-02', '16:00:00', '00:00:00', 0, 0, 'Норма'),
(14, '2025-10-01', '00:02:00', '07:58:00', 2, 2, 'Опоздание и ранний уход'),
(14, '2025-10-02', '00:00:00', '08:00:00', 0, 0, 'Норма'),
(15, '2025-10-01', '08:15:00', '16:00:00', 15, 0, 'Опоздание на 15 минут'),
(15, '2025-10-02', '08:00:00', '16:00:00', 0, 0, 'Норма'),
(16, '2025-10-01', '16:02:00', '23:50:00', 2, 10, 'Опоздание и ранний уход'),
(16, '2025-10-02', '16:00:00', '00:00:00', 0, 0, 'Норма'),
(17, '2025-10-01', '00:00:00', '08:00:00', 0, 0, 'Норма'),
(17, '2025-10-02', '00:00:00', '08:00:00', 0, 0, 'Норма'),
(18, '2025-10-01', '08:00:00', '16:00:00', 0, 0, 'Норма'),
(18, '2025-10-02', '08:00:00', '16:00:00', 0, 0, 'Норма'),
(19, '2025-10-01', '16:20:00', '23:55:00', 20, 5, 'Опоздание на 20 минут и ранний уход на 5 минут'),
(19, '2025-10-02', '16:00:00', '00:00:00', 0, 0, 'Норма'),
(20, '2025-10-01', '00:05:00', '07:55:00', 5, 5, 'Опоздание и ранний уход'),
(20, '2025-10-02', '00:00:00', '08:00:00', 0, 0, 'Норма'),
(21, '2025-10-01', '08:10:00', '15:55:00', 10, 5, 'Опоздание и ранний уход'),
(21, '2025-10-02', '08:00:00', '16:00:00', 0, 0, 'Норма'),
(22, '2025-10-01', '16:00:00', '00:00:00', 0, 0, 'Норма'),
(22, '2025-10-02', '16:00:00', '00:00:00', 0, 0, 'Норма'),
(23, '2025-10-01', '00:00:00', '08:00:00', 0, 0, 'Норма'),
(23, '2025-10-02', '00:00:00', '08:00:00', 0, 0, 'Норма'),
(24, '2025-10-01', '00:05:00', '07:55:00', 5, 5, 'Опоздание и ранний уход'),
(24, '2025-10-02', '00:00:00', '08:00:00', 0, 0, 'Норма'),
(25, '2025-10-01', '16:05:00', '00:00:00', 5, 0, 'Опоздание на 5 минут'),
(25, '2025-10-02', '16:00:00', '00:00:00', 0, 0, 'Норма'),
(26, '2025-10-01', '00:10:00', '07:45:00', 10, 15, 'Опоздание и ранний уход'),
(26, '2025-10-02', '00:00:00', '08:00:00', 0, 0, 'Норма'),
(27, '2025-10-01', '08:00:00', '16:00:00', 0, 0, 'Норма'),
(27, '2025-10-02', '08:00:00', '16:00:00', 0, 0, 'Норма'),
(28, '2025-10-01', '16:00:00', '00:00:00', 0, 0, 'Норма'),
(28, '2025-10-02', '16:00:00', '00:00:00', 0, 0, 'Норма'),
(29, '2025-10-01', '00:00:00', '08:00:00', 0, 0, 'Норма'),
(29, '2025-10-02', '00:00:00', '08:00:00', 0, 0, 'Норма'),
(30, '2025-10-01', '08:05:00', '15:54:00', 5, 6, 'Опоздание и ранний уход'),
(30, '2025-10-02', '08:00:00', '16:00:00', 0, 0, 'Норма'),
(31, '2025-10-01', '16:03:00', '00:00:00', 3, 0, 'Опоздание на 3 минут'),
(31, '2025-10-02', '16:00:00', '00:00:00', 0, 0, 'Норма'),
(32, '2025-10-01', '00:00:00', '08:00:00', 0, 0, 'Норма'),
(32, '2025-10-02', '00:00:00', '08:00:00', 0, 0, 'Норма'),
(33, '2025-10-01', '08:15:00', '16:00:00', 15, 0, 'Опоздание на 15 минут'),
(33, '2025-10-02', '08:00:00', '16:00:00', 0, 0, 'Норма'),
(34, '2025-10-01', '16:04:00', '23:56:00', 4, 4, 'Опоздание и ранний уход'),
(34, '2025-10-02', '16:00:00', '00:00:00', 0, 0, 'Норма');


-- Вставка данных в таблицу Документы отсутствия

INSERT INTO absence_documents (employee_id, absence_type, start_date, end_date, document_number, issued_by)
VALUES 
(5, 'vacation', '2025-10-05', '2025-10-12', 'ОТ-1234', 'Отдел кадров'),
(7, 'sick_leave', '2025-10-03', '2025-10-17', 'БЛ-1234', 'Городская поликлиника'),
(10, 'vacation', '2025-10-09', '2025-10-16', 'ОТ-12345', 'Отдел кадров'),
(12, 'sick_leave', '2025-12-07', '2025-12-21', 'БЛ-12345', 'Городская поликлиника'),
(20, 'vacation', '2025-03-05', '2025-03-12', 'ОТ-123456', 'Отдел кадров'),
(30, 'sick_leave', '2025-05-09', '2025-05-23', 'БЛ-123456', 'Городская поликлиника');

-- Вставка данных в таблицу Табели учета

INSERT INTO timesheets (employee_id, period_start, period_end, total_hours, overtime_hours, approved_by, approval_date)
VALUES 
(1, '2025-01-01', '2025-06-30', 940.00, 40.00, 'Начальник цеха', '2026-01-12'),
(2, '2025-01-01', '2025-06-30', 930.00, 90.00, 'Начальник цеха', '2026-01-12'),
(3, '2025-01-01', '2025-06-30', 900.00, 0.00, 'Начальник цеха', '2026-01-12'),
(4, '2025-01-01', '2025-06-30', 900.00, 0.00, 'Начальник цеха', '2026-01-12'),
(5, '2025-01-01', '2025-06-30', 940.00, 0.00, 'Начальник цеха', '2026-01-12'),
(6, '2025-01-01', '2025-06-30', 900.00, 5.00, 'Начальник цеха', '2026-01-12'),
(7, '2025-01-01', '2025-06-30', 920.00, 0.00, 'Начальник цеха', '2026-01-12'),
(8, '2025-01-01', '2025-06-30', 900.00, 0.00, 'Начальник цеха', '2026-01-12'),
(9, '2025-01-01', '2025-06-30', 930.00, 0.00, 'Начальник цеха', '2026-01-12'),
(10, '2025-01-01', '2025-06-30', 900.00, 10.00, 'Начальник цеха', '2026-01-12'),
(11, '2025-01-01', '2025-06-30', 910.00, 0.00, 'Начальник цеха', '2026-01-12'),
(12, '2025-01-01', '2025-06-30', 900.00, 0.00, 'Начальник цеха', '2026-01-12'),
(13, '2025-01-01', '2025-06-30', 940.00, 50.00, 'Начальник цеха', '2026-01-12'),
(14, '2025-01-01', '2025-06-30', 900.00, 0.00, 'Начальник цеха', '2026-01-12'),
(15, '2025-01-01', '2025-06-30', 900.00, 0.00, 'Начальник цеха', '2026-01-12'),
(16, '2025-01-01', '2025-06-30', 925.00, 0.00, 'Начальник цеха', '2026-01-12'),
(17, '2025-01-01', '2025-06-30', 890.00, 0.00, 'Начальник цеха', '2026-01-12'),
(18, '2025-01-01', '2025-06-30', 930.00, 0.00, 'Начальник цеха', '2026-01-12'),
(19, '2025-01-01', '2025-06-30', 900.00, 0.00, 'Начальник цеха', '2026-01-12'),
(20, '2025-01-01', '2025-06-30', 920.00, 0.00, 'Начальник цеха', '2026-01-12'),
(21, '2025-01-01', '2025-06-30', 900.00, 0.00, 'Начальник цеха', '2026-01-12'),
(22, '2025-01-01', '2025-06-30', 920.00, 0.00, 'Начальник цеха', '2026-01-12'),
(23, '2025-01-01', '2025-06-30', 900.00, 0.00, 'Начальник цеха', '2026-01-12'),
(24, '2025-01-01', '2025-06-30', 930.00, 45.00, 'Начальник цеха', '2026-01-12'),
(25, '2025-01-01', '2025-06-30', 930.00, 0.00, 'Начальник цеха', '2026-01-12'),
(26, '2025-01-01', '2025-06-30', 900.00, 10.00, 'Начальник цеха', '2026-01-12'),
(27, '2025-01-01', '2025-06-30', 920.00, 0.00, 'Начальник цеха', '2026-01-12'),
(28, '2025-01-01', '2025-06-30', 900.00, 4.00, 'Начальник цеха', '2026-01-12'),
(29, '2025-01-01', '2025-06-30', 930.00, 0.00, 'Начальник цеха', '2026-01-12'),
(30, '2025-01-01', '2025-06-30', 900.00, 5.00, 'Начальник цеха', '2026-01-12'),
(31, '2025-01-01', '2025-06-30', 940.00, 0.00, 'Начальник цеха', '2026-01-12'),
(32, '2025-01-01', '2025-06-30', 900.00, 0.00, 'Начальник цеха', '2026-01-12'),
(33, '2025-01-01', '2025-06-30', 940.00, 9.00, 'Начальник цеха', '2026-01-12'),
(34, '2025-01-01', '2025-06-30', 900.00, 0.00, 'Начальник цеха', '2026-01-12');

-- Вставка пользователей


INSERT INTO users (username, password_hash, role, employee_id)
VALUES 
('master_ivan', 'hashed_pass_1', 'master', 1),
('chief_petr', 'hashed_pass_2', 'chief', 2),
('accountant_anna', 'hashed_pass_3', 'accountant', NULL),
('hr_olga', 'hashed_pass_4', 'hr', NULL),
('admin_alex', 'hashed_pass_5', 'admin', NULL);

INSERT INTO users (username, password_hash, role, employee_id)
values
('master_valery', 'hashed_pass_6', 'master', 13),
('master_fedor', 'hashed_pass_7', 'master', 24);





















